{
  "intents": [
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Start navigating to MG Road.",
        "Find the fastest route to Electronic City, considering current traffic.",
        "How do I drive to Vidhana Soudha from here?",
        "Give me directions to Koramangala 80 Feet Road.",
        "Show me the quickest way to Lal Bagh Botanical Garden.",
        "Where is the RVCE Computer Science Department on campus?",
        "Guide me to the RVCE Main Canteen from the hostel.",
        "How do I get to the RVCE Auditorium?",
        "Take me to the RVCE Library.",
        "Directions to the RVCE Sports Complex from the Main Gate.",
        "Drive me from RVCE Main Gate to Majestic Bus Stand.",
        "What's the best route from Indiranagar to RVCE campus?",
        "Can you show me the way to RVCE from Bannerghatta Road, avoiding heavy traffic?",
        "Start navigation to Kempegowda International Airport from RVCE.",
        "What's the current traffic situation to Cubbon Park?",
        "How long will it take to drive to Jayanagar 4th Block right now?",
        "Are there any tolls on the recommended route to Whitefield?",
        "Update me on the shortest route to RVCE from Basavanagudi.",
        "Is there an auto-parking spot available near UB City, and guide me there?",
        "Activate reverse parking assist and show guidelines."
      ],
      "responses": [
        "Navigating to {destination}. The current estimated travel time is {travel_time} with {traffic_status} traffic.",
        "Found the best route to {destination}. Starting navigation now. Please follow the instructions.",
        "Okay, I'm showing you the current traffic situation and estimated travel time to {destination}: {traffic_status}, {travel_time}. Would you like to proceed?",
        "Activating {parking_type} parking assist. Please follow the on-screen guidelines.",
        "Guiding you to {destination}. You're currently {distance} away. I'll alert you to any route changes or delays."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to the RVCE Main Gate.",
        "What's the best route to the RVCE Mechanical Department from my current location?",
        "How do I get to the RVCE Boys Hostel?",
        "Show me the path to the RVCE Auditorium.",
        "Is there a shortcut to the RVCE Canteen from the Library?",
        "Find the nearest parking spot to the RVCE Computer Science block.",
        "Guide me to the RVCE administrative office.",
        "What's the estimated time to reach RVCE from Silk Board?",
        "Take me back to the RVCE Main Gate.",
        "Update my route to RVCE to avoid heavy traffic on Mysore Road.",
        "Where is the RVCE Electrical Department?",
        "Plot a route from RVCE to Forum Mall, Koramangala.",
        "Find the fastest way from RVCE campus to Bangalore University's Jnanabharathi Campus.",
        "What's the current traffic situation near RVCE?",
        "Can you show me the route to the RVCE Girls Hostel?",
        "What's the traffic like on Outer Ring Road near Marathahalli?",
        "Find an alternative route to Majestic Bus Stand avoiding tolls.",
        "How far is Cubbon Park from my current location?",
        "Set navigation to Bengaluru Airport, Terminal 1.",
        "Is there a quicker way to reach Jayanagar 4th Block right now?"
      ],
      "responses": [
        "Navigating to {destination}. The estimated travel time is {time} minutes.",
        "Found {number} routes. The fastest route is {time} minutes, covering {distance} kilometers.",
        "Rerouting to avoid traffic. New estimated arrival time is {new_time}.",
        "Certainly, guiding you back to {destination}. Please follow the directions.",
        "Here's the current traffic information for your route to {destination}. It looks clear/congested around {area}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate.",
        "What's the fastest way to Indiranagar from RVCE Hostel Block A?",
        "Directions to Electronic City Phase 1 from RVCE.",
        "Take me to the RVCE Computer Science Department.",
        "Find the nearest petrol pump near RVCE campus.",
        "How do I get to MG Road from my current location?",
        "Where is the RVCE Canteen located within the campus?",
        "Show me the route to Lalbagh Botanical Garden from here.",
        "Can you guide me to the RVCE Auditorium?",
        "I need to go to Jayanagar 4th Block.",
        "What's the estimated time of arrival at RVCE Hostel?",
        "Are there any traffic jams on the way to Koramangala from RVCE?",
        "What's my next turn on this route?",
        "How far is Whitefield from here?",
        "Show me alternative routes to Bengaluru Airport.",
        "Are there any tolls on this route to RVCE?",
        "What's the total distance to the RVCE Library from the Main Gate?",
        "How do I avoid Hebbal flyover traffic to reach Manyata Tech Park?",
        "Can you help me reverse park into this available spot?",
        "I need to reverse my current route and head back. What's the quickest way to RVCE Main Gate from here?"
      ],
      "responses": [
        "Starting navigation to {destination}. The journey is approximately {distance} and will take {time} with current traffic.",
        "The quickest way to {destination} is via {road name}. There are no tolls on this route.",
        "Your next instruction is to {turn/action} in {distance}. I've detected {traffic issue} ahead and am looking for alternative routes.",
        "To reverse park, please shift to reverse gear. I will provide audio and visual guidance using your vehicle's sensors.",
        "I've calculated a new route for you, avoiding the current traffic near {landmark}. You'll arrive at {destination} at {new time}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I get to the RVCE CSE Department from my current location?",
        "What's the fastest way from RVCE Main Gate to Electronic City?",
        "Guide me to the RVCE Library.",
        "What's the estimated time of arrival at RVCE Hostel from Majestic Bus Stand?",
        "Start navigation to the RVCE Canteen.",
        "Are there any traffic delays on the way to RVCE from Koramangala?",
        "Show me the route to UB City from RVCE, avoiding highways.",
        "What's the next turn I need to take to reach RVCE Auditorium?",
        "How far is the RVCE Sports Complex from here?",
        "Find an alternative route to RVCE from KR Puram due to heavy traffic.",
        "Can you provide a reverse route from RVCE to Vidhana Soudha?",
        "What's the current speed limit on Mysore Road near RVCE?",
        "Navigate to the RVCE East Hostel block.",
        "Enable automatic re-routing if there are significant delays on the way to RVCE.",
        "How long to reach RVCE from Bangalore Airport via the fastest route?",
        "What's the current traffic status around Kengeri Satellite Town on my way to RVCE?",
        "Where is the nearest fuel station on my current route to RVCE?",
        "Stop the current navigation to RVCE.",
        "Give me a summary of my route to RVCE's Computer Science Block.",
        "Is there a quicker way to the RVCE Innovation Centre avoiding the main road?"
      ],
      "responses": [
        "Navigating to {destination}. The fastest route is {distance} and will take approximately {eta}.",
        "Traffic on your route to {destination} is {traffic_status}, with an estimated delay of {delay_minutes} minutes. I can suggest an alternative route.",
        "Your next instruction is to {instruction} in {distance} meters/kilometers. The speed limit here is {speed_limit} km/h.",
        "I've found the route to {destination}, specifically within the RVCE campus. Starting guidance now.",
        "Route information to {destination}: Expected ETA is {eta}, covering {distance}. I can also provide a reverse route if needed."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest way to get to RVCE from Koramangala right now?",
        "Show me the current traffic situation on Mysore Road towards Kengeri.",
        "Can you guide me to the RVCE CSE department building?",
        "Is there a quicker route to RVCE Main Gate from the Hostel block?",
        "How long will it take to reach Global Village Tech Park from RVCE considering current traffic?",
        "Find me a route to Orion Mall at Brigade Gateway that avoids tolls.",
        "Where can I find parking near the RVCE Auditorium?",
        "Initiate automatic parking for this spot.",
        "What's the best route from RVCE to Kengeri Metro Station with less traffic?",
        "Tell me the turn-by-turn directions to the RVCE Canteen from the ECE department.",
        "Guide me to reverse park into this spot.",
        "Are there any road closures between RVCE and Banashankari?",
        "What's the estimated time of arrival at Bengaluru Airport if I leave RVCE now?",
        "Show me the route details for the shortest path to RVCE Sports Complex.",
        "Direct me to the RVCE Library from the Mechanical Department.",
        "Is there a specific student parking zone near the Main Academic Block at RVCE?",
        "What's the current traffic on Outer Ring Road near Silk Board Junction?",
        "How do I get to Gopalan Arcade Mall from RVCE?",
        "Can you show me alternative routes to RVCE from Jayanagar 4th Block?",
        "Start guided parking for reversing into the available slot."
      ],
      "responses": [
        "Calculating the optimal route to {destination}, considering current traffic conditions in Bangalore. Starting navigation.",
        "Found the quickest route to {destination}. It's {distance} and will take approximately {time} minutes. Would you like to see alternative options or details on tolls?",
        "Initiating automatic parking for the detected spot. Please follow the prompts on your screen.",
        "Activating reverse parking assistance. Please shift to reverse gear and I will guide you with visual and audio cues.",
        "Navigating you to {RVCE_campus_location}. The route is clear within the campus, estimated arrival in {time} minutes."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Start navigation to the RVCE Main Gate.",
        "What's the quickest way to the RVCE CSE Department from my current location?",
        "Drive me to the RVCE Girls Hostel.",
        "Show me the route to the RVCE Auditorium from the Sports Complex.",
        "Navigate to Electronic City, please.",
        "Find the fastest route from RVCE to Kempegowda International Airport.",
        "Take me to MG Road.",
        "Guide me to Jayanagar 4th Block.",
        "I need directions to Lalbagh Botanical Garden.",
        "Where's the nearest petrol pump from RVCE, and can you navigate me there?",
        "What's the current traffic situation on the way to RVCE from Koramangala?",
        "How long will it take to reach the RVCE Canteen from the Library, considering campus walking routes?",
        "Are there any tolls or road closures on the route to Vidhana Soudha right now?",
        "Show me alternative routes to Indiranagar, avoiding high-traffic zones.",
        "What's my estimated time of arrival at the RVCE Boys Hostel from the Main Gate?",
        "Can you take me back to the RVCE Main Gate?",
        "Reverse my current route.",
        "Guide me back to my last parking spot near UB City.",
        "Recalculate the route to RVCE Mechanical Department if there's a new jam.",
        "Does the navigation automatically adjust if I miss a turn?"
      ],
      "responses": [
        "Navigating to {destination}. You'll arrive in approximately {ETA}.",
        "Route updated. I've found a faster path, avoiding current heavy traffic. New ETA is {new_ETA}.",
        "There are {number} alternative routes. The quickest one is {time_duration} via {main_road}, with {traffic_level} traffic.",
        "Guiding you back to {previous_point}. Please follow the directions to proceed.",
        "Confirmed. The current route to {destination} has {traffic_condition} traffic. Your estimated arrival is {ETA}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest way to Koramangala 8th Block from my current location?",
        "Show me the route to Majestic bus stand from here.",
        "How much traffic is there on Outer Ring Road towards Marathahalli right now?",
        "Navigate to Lalbagh Botanical Garden.",
        "Find an alternative route to UB City to avoid traffic.",
        "What's my estimated time of arrival at Kempegowda International Airport?",
        "Is there a quicker way to reach Jayanagar 4th Block?",
        "Tell me the next turn on this current route.",
        "Take me to the RVCE Main Gate.",
        "Navigate to the RVCE Boys' Hostel.",
        "Where is the Mechanical Engineering Department at RVCE campus?",
        "How do I get to the RVCE Canteen from the CSE Department?",
        "Show me the path to the RVCE Auditorium.",
        "What's the distance to RVCE from Mysore Road?",
        "Can you guide me to the nearest visitor parking spot near the RVCE Library?",
        "Start navigation to the RVCE Computer Science Department.",
        "What's the current traffic situation around RVCE campus?",
        "How far is the RVCE Ladies' Hostel from the Main Gate?",
        "Can you show me the reverse path I just drove from Kengeri to RVCE?",
        "Is there an auto-parking feature I can use near this parking bay at RVCE?"
      ],
      "responses": [
        "Starting navigation to {destination}. Your estimated arrival time is {time} with current traffic.",
        "Okay, displaying the best route to {destination} now. Please follow the directions on the screen.",
        "Your next turn is {direction} onto {road_name} in {distance}. The remaining distance is {total_distance}.",
        "Found multiple routes to {destination}. One is {time1} via {route1} and another is {time2} via {route2}.",
        "Understood. Providing information on {feature} or adjusting the route as requested."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the best route to Indiranagar from my current location?",
        "Navigate to Electronic City via NICE Road.",
        "Show me the way to Lalbagh Botanical Garden, avoiding tolls.",
        "Drive to Bannerghatta Road near IIM Bangalore.",
        "Find the quickest path to Kempegowda International Airport right now.",
        "How do I get to the RVCE Boys Hostel from the main gate?",
        "Navigate to the RVCE Mechanical Department building.",
        "Take me to the RVCE Canteen.",
        "Drive to the Sports Complex within the RVCE campus.",
        "Guide me to BGS Global Hospital from RVCE main gate.",
        "Help me reverse park into this spot.",
        "Is there any automatic parking available in this area?",
        "Can you guide me to the nearest available parking at RVCE?",
        "Reroute me to avoid the traffic near Silk Board junction.",
        "Automatically find an alternative route if there's heavy congestion ahead.",
        "Enable auto-guidance for the RVCE campus parking lot.",
        "What's the estimated time of arrival at RVCE main gate?",
        "Are there any traffic delays on Mysore Road right now?",
        "How far is the RVCE Library from the CSE Department?",
        "Give me an overview of the current route to Jayanagar."
      ],
      "responses": [
        "Navigating to {destination}. Please follow the on-screen directions.",
        "Initiating parking assistance. Drive slowly and I'll guide you into the spot.",
        "Analyzing current route conditions. You can expect to arrive at {destination} in approximately {time}.",
        "Understood. Guiding you to {location}. It's {distance} from your current position within the campus.",
        "Checking for faster routes. I've found an alternative that avoids the traffic near {area} and saves you about {time_saved} minutes. Would you like to switch?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest route to RVCE Main Gate from Majestic?",
        "Start navigation to RVCE Canteen from the CSE Department.",
        "How do I get to the RVCE Hostel Block A from the college main gate?",
        "Is there heavy traffic on Mysore Road towards RVCE right now?",
        "Show me the route to Orion Mall from RVCE, avoiding toll roads.",
        "What's the estimated arrival time at Electronic City from my current location near RVCE?",
        "Which direction am I currently heading?",
        "Can you activate reverse parking assistance for this spot?",
        "What's the next turn on my way to Koramangala?",
        "Find the shortest path to the RVCE Auditorium from the Library.",
        "Are there any alternative routes to reach Manyata Tech Park from RVCE?",
        "Guide me to the RVCE Sports Ground.",
        "What's the current traffic situation near Silk Board Junction?",
        "Engage auto-park for this parallel parking space.",
        "How far is Cubbon Park from RVCE via the fastest route?",
        "Tell me the distance to the RVCE ECE Department from here.",
        "Please show me the route overview to JP Nagar.",
        "Is it safe to engage automatic driving mode on this highway?",
        "What's the best route to UB City from RVCE at this time of day?",
        "Cancel current navigation and show me nearby RVCE departmental buildings."
      ],
      "responses": [
        "Starting navigation to {destination}. The fastest route shows an ETA of {time}.",
        "Acknowledged. Activating {feature} now. Please confirm your readiness to proceed, and keep an eye on your surroundings.",
        "You are currently heading {direction}. Your next maneuver is {turn_instruction} in approximately {distance}.",
        "Checking route details. There is {traffic_condition} at {location}. I've identified an alternative that could save you {time_saved}.",
        "Understood. Displaying the detailed route to {destination} on your screen, including current traffic and potential delays."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to MG Road, Bangalore.",
        "What's the fastest route to Electronic City right now?",
        "Take me to the RVCE Main Gate.",
        "Show me directions to the RVCE Hostel Block B.",
        "Find the quickest way to the RVCE Canteen from here.",
        "Guide me to the Computer Science Department building at RVCE.",
        "What's the estimated time of arrival at Vidhana Soudha?",
        "Are there any tolls on the route to Kempegowda International Airport?",
        "What's the next turn on this current route?",
        "Show me alternative routes to Kengeri Satellite Town.",
        "How do I get to Global Village Tech Park?",
        "Set my navigation preferences to automatically avoid highways.",
        "Can you enable auto-rerouting for traffic delays?",
        "What's the traffic situation near Silk Board Junction currently?",
        "Where is the RVCE Auditorium located?",
        "Is it possible to reverse the current navigation and take me back to my starting point?",
        "Show me the path to the RVCE Library.",
        "Find the nearest ATM on the way to Koramangala.",
        "Can you display the total distance to BGS Gleneagles Global Hospital?",
        "Always choose the most fuel-efficient route. Set that automatically."
      ],
      "responses": [
        "Navigating to {destination}. The current ETA is {estimated_time} via {route_name}.",
        "The traffic ahead is {traffic_condition}. Would you like to re-route? The alternative could save you {time_saved} minutes.",
        "Your next step is to {turn_instruction} in {distance} meters. You are {distance_to_destination} away from your destination.",
        "I've set your navigation to {auto_setting_description}. Routes will now be calculated to {optimization_goal}.",
        "To reverse your current route, I can guide you back to your starting point, or find the quickest way back to {previous_location}. Which would you prefer?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to the RVCE Main Gate.",
        "What's the fastest route to RVCE Boys Hostel from my current location?",
        "Guide me to the CSE Department inside RVCE campus.",
        "Show me the way to the RVCE Canteen from the Library.",
        "Find the quickest route to Electronic City from RVCE, avoiding toll roads.",
        "How do I get to Kengeri Metro Station from here?",
        "Drive me to Majestic Bus Stand via Bannerghatta Road.",
        "Take me to Lalbagh Botanical Garden, please.",
        "What's the best way to reach RVCE Girls Hostel from the college's sports complex?",
        "Set navigation to RVCE Auditorium.",
        "What's the traffic situation like on Mysore Road towards Nayandahalli?",
        "How many more kilometers until we arrive at RVCE?",
        "Tell me my next turn.",
        "Are there any alternative routes to Koramangala to avoid congestion?",
        "Are there any reported road closures near RVCE campus?",
        "Reverse my current route and take me back to my starting point.",
        "Cancel this navigation and find a route back to Global Village Tech Park.",
        "Can you find a route to the nearest auto-rickshaw stand from RVCE?",
        "Start automatic re-routing if there's heavy traffic ahead.",
        "Where's the best place to park near the RVCE Mechanical Department?"
      ],
      "responses": [
        "Starting navigation to {destination}. The journey is approximately {duration}.",
        "Found a route to {location}. Traffic appears {traffic_level}. Would you like to proceed?",
        "Your next instruction is to {turn_direction} onto {road_name} in {distance}.",
        "Re-calculating route to {destination}. Please confirm.",
        "Displaying current traffic and estimated arrival time: {ETA}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the current traffic situation on the route to RVCE from Silk Board?",
        "Guide me to the RVCE Mechanical Department.",
        "Show me the fastest way to the RVCE Girls Hostel from the main gate.",
        "What's my ETA if I drive to MG Road right now?",
        "Are there any alternate routes to Electronics City avoiding toll plazas?",
        "Start automatic parallel parking.",
        "Display the reverse camera view.",
        "How far is the RVCE Canteen from my current location on campus?",
        "Navigate to the RVCE Admin Block.",
        "Tell me about the traffic on Mysore Road towards Kengeri.",
        "Show me the route to the RVCE Library.",
        "Is there a parking spot available near the RVCE Auditorium?",
        "What's the best way to get to Koramangala from RVCE?",
        "Can you warn me if I get too close to an obstacle while reversing?",
        "Update me on the road conditions near Manyata Tech Park.",
        "Find the shortest driving path to the RVCE Main Gate.",
        "Where's the nearest EV charging station on my route to Whitefield?",
        "Initiate the perpendicular parking maneuver.",
        "How long will it take to reach Bengaluru Airport from RVCE?",
        "Show me the campus map of RVCE with my current position."
      ],
      "responses": [
        "Navigating to {destination}. Current ETA is {time} minutes with light traffic.",
        "Displaying the requested camera view. Please proceed with caution.",
        "Activating automatic parking. Follow the prompts on your screen and be ready to intervene.",
        "Route details for {location}: {distance} kilometers, estimated travel time {time}.",
        "Checking for alternate routes and live traffic updates. Found a quicker path avoiding tolls, would you like to switch?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest driving route to RVCE Main Gate from my current location?",
        "Show me the precise driving directions to the Computer Science Department within RVCE campus.",
        "How do I drive from the RVCE Library to the RVCE Canteen?",
        "Navigate to Global Village Tech Park from RVCE campus, considering current traffic.",
        "Find me the quickest driving way to Kengeri Bus Terminal from here.",
        "Route me to the nearest petrol pump near RVCE, avoiding any U-turns.",
        "Is there a different driving route to Bannerghatta Road to avoid the current peak hour traffic?",
        "Take me to RVCE Boys Hostel Block C, detailing each turn.",
        "What's the estimated drive time to RVCE Auditorium from Marathahalli right now?",
        "Guide me to the RVCE Sports Complex entrance for parking.",
        "What's the current traffic situation on Mysore Road towards RVCE main campus entrance?",
        "Are there any road closures or diversions on the drive to RVCE from Koramangala?",
        "Show me the next two turns on this route to the RVCE Admin Block.",
        "Can you help me find a parking spot near the RVCE ECE Department?",
        "Initiate the parallel parking assist and guide me while reversing into that spot.",
        "Will I encounter any tolls on this driving route to Electronic City from RVCE?",
        "Give me a step-by-step breakdown of the driving route to RVCE Girls Hostel.",
        "Recalculate the driving route to Majestic Bus Stand, prioritizing less congested roads.",
        "Activate the reverse camera and provide audio guidance to back into this bay.",
        "Start automatic parking to reverse into this perpendicular spot."
      ],
      "responses": [
        "Okay, calculating the fastest driving route to your destination, considering current traffic. Please confirm if you wish to proceed.",
        "Initiating parking assistance now. Please follow the on-screen prompts and audio guidance to reverse safely into the spot.",
        "The route to {destination} is {distance} and will take approximately {time} with {traffic_condition} traffic. The next turn is {turn_direction} onto {street_name}.",
        "Rerouting to {destination} to avoid {issue}. The new estimated arrival time is {new_time}.",
        "I can guide you there. The {department/building} is located {direction/description} from your current position on campus. Would you like me to start navigation?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Take me to RVCE Main Gate from my current location.",
        "What's the fastest route to Electronic City from RVCE?",
        "Guide me to the RVCE CSE Department. I'm near the main gate.",
        "Is there a parking spot available near the RVCE Canteen?",
        "How do I get to the RVCE Hostel from the Sports Complex?",
        "Show me the traffic conditions to Marathahalli from RVCE right now.",
        "Are there any alternative routes to Koramangala from RVCE to avoid heavy traffic?",
        "What's the estimated time of arrival at Bengaluru Airport from RVCE?",
        "Can you help me reverse into this parking spot outside the RVCE Library?",
        "Navigate to Lalbagh Botanical Garden from RVCE, avoiding toll roads.",
        "Where is the nearest ATM within the RVCE campus?",
        "Give me directions to the RVCE ECE Department from the Auditorium.",
        "How far is MG Road from RVCE?",
        "Guide me to the RVCE Director's Office.",
        "Can you auto-guide me to the nearest available parking space at RVCE?",
        "Is there a shorter way to Jayanagar 4th Block from RVCE?",
        "What's the current traffic situation on Mysore Road heading towards RVCE?",
        "Show me the best route to Cubbon Park from RVCE.",
        "What's the speed limit on the road leading to RVCE from Kengeri?",
        "Can you provide a reverse camera view and guidelines for this tight spot?"
      ],
      "responses": [
        "Starting navigation to {destination}. The journey is estimated to take {time} minutes.",
        "Here is the fastest route to {destination} considering current traffic conditions.",
        "Activating reverse assist. Please proceed slowly and follow the on-screen guidelines.",
        "I'm searching for available parking near {location} and will guide you to the best option automatically.",
        "You're currently {distance} kilometers away from {destination}. Traffic is light."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate.",
        "Take me to the RVCE Boys Hostel from the main gate.",
        "Find the fastest route to Koramangala from RVCE.",
        "Show me the way to the RVCE CSE Department.",
        "What's the best route to Electronic City from here?",
        "How do I get to the RVCE Canteen from the Mechanical Block?",
        "Can you guide me to the RVCE Auditorium?",
        "Navigate to MG Road, Bangalore.",
        "Is there a quicker route to Majestic Bus Stand right now?",
        "Guide me to the visitor parking lot near RVCE Main Gate.",
        "What's the estimated time of arrival at RVCE Library?",
        "Are there any traffic delays on the way to Bannerghatta Road?",
        "Show me alternative routes to Jayanagar.",
        "How much longer until I reach the RVCE Admin Block?",
        "What's the current traffic situation near Mysore Road junction?",
        "Avoid tolls on the current route to Indiranagar.",
        "Start reverse parking assistance.",
        "Can you show me the fastest way to reach the RVCE Sports Complex from the Canteen?",
        "How do I get to the nearest petrol station from RVCE?",
        "What is the current speed limit on this road while driving towards Marathahalli?"
      ],
      "responses": [
        "Starting navigation to {destination}. Please drive safely and follow the directions.",
        "Your estimated time of arrival at {destination} is {ETA} minutes, with {traffic_condition} traffic ahead.",
        "Engaging reverse assist. The parking spot is on your {left/right}. Please proceed slowly and carefully.",
        "I've found an alternative route to {destination} that avoids heavy traffic, potentially saving you {time_saved} minutes. Would you like to switch?",
        "Directing you to {RVCE_location} within the campus. It's approximately a {distance} meter walk or {time} minute drive."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate from my current location.",
        "What's the quickest way to Electronic City from RVCE Canteen?",
        "Guide me to the RVCE Girls' Hostel.",
        "Show me the route options to UB City from the college.",
        "Is there a parking spot near the RVCE Mechanical Engineering Department?",
        "Can you guide me while I reverse park near the RVCE Auditorium?",
        "Start navigation to Kempegowda International Airport, avoiding tolls.",
        "What's the current traffic like on Mysore Road near RVCE?",
        "Take me to the CSE Department from the main entrance of RVCE.",
        "Can you find a shortcut from RVCE to JP Nagar?",
        "Where is the nearest ATM within the RVCE campus?",
        "Show me the fastest route to Forum Mall, Koramangala from RVCE.",
        "What's my estimated time of arrival at the RVCE Library?",
        "Can you automatically reroute if there's heavy traffic ahead on Bannerghatta Road?",
        "How do I get to the RVCE Sports Complex from the Boys' Hostel?",
        "Are there any detours or road closures on the way to Indiranagar from RVCE?",
        "What's the distance remaining to RVCE Placement Office?",
        "Guide me to the RVCE Canteen from the Administrative Block.",
        "Can you assist with a safe reverse turn near the RVCE Workshop?",
        "Is this the optimal route to Lalbagh from RVCE?"
      ],
      "responses": [
        "Navigating to {destination}. Please follow the directions on the screen.",
        "The current route to {destination} is estimated to take {time} minutes, covering {distance} kilometers with {traffic_condition} traffic.",
        "I've found {number} alternative routes to {destination}. The fastest one avoids {road_type} and saves {time_saved} minutes.",
        "Guiding you within the RVCE campus to {campus_location}. Turn {direction} at the next intersection.",
        "Of course, I can help with that. Shifting to reverse view now. Please proceed slowly, and I'll highlight the path."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I get to the RVCE CSE Department from the main gate?",
        "Where is the RVCE Girls' Hostel located on campus?",
        "Guide me to the RVCE Canteen from the Quadrangle.",
        "What's the quickest route to the RVCE Auditorium from the Library building?",
        "Show me directions to the RVCE Mechanical Engineering Department.",
        "Find the nearest parking spot to the RVCE Admin Block.",
        "Is there a shortcut to the RVCE Playground from the Electrical Department?",
        "Take me to Global Village Tech Park from RVCE.",
        "How far is RVCE from Kengeri Satellite Town Bus Terminal?",
        "Directions to RVCE from Mysore Road Satellite Bus Stand.",
        "Navigate to Forum Mall, Koramangala, from my current location near RVCE.",
        "What's the traffic like on Outer Ring Road towards Marathahalli right now?",
        "Find an alternate route to Electronic City, avoiding tolls if possible.",
        "How long will it take to reach Indiranagar from Jayanagar at this time?",
        "What's the next turn on this route to MG Road?",
        "Are there any speed cameras reported on Bannerghatta Road currently?",
        "Show me the fastest way to Kempegowda International Airport.",
        "Re-route to Majestic instead of Cubbon Park for my destination.",
        "Can you help me parallel park into this spot?",
        "Guide me while reversing into the parking bay behind the RVCE Chemistry Lab."
      ],
      "responses": [
        "Starting navigation to {destination}. Please follow the voice prompts and screen directions.",
        "Calculating the optimal route to {destination}. Your current estimated time of arrival is {time}.",
        "I can assist with that. Please prepare to reverse, and I'll guide you step-by-step.",
        "Activating parking assist. Please select the type of parking and I'll guide you through it.",
        "You're currently on the quickest path. The next instruction is {turn_distance} ahead, {turn_direction}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Drive me to Electronic City, please.",
        "Find the quickest route to Koramangala from my current location.",
        "Navigate to Bangalore International Airport, avoiding congested areas.",
        "Set destination to MG Road, please.",
        "Guide me to Lalbagh Botanical Garden.",
        "Where is the RVCE CSE Department? Start navigation.",
        "Take me to the RVCE Main Gate.",
        "I need to get to RVCE Hostel Block A. What's the best way?",
        "Direct me to the RVCE Auditorium.",
        "Show me the way to the RVCE Canteen.",
        "Reverse my current route to go back to the starting point.",
        "Go back to the last navigated location, which was RVCE Library.",
        "What's the estimated time of arrival at Vidhana Soudha?",
        "Are there any tolls on the route to Indiranagar?",
        "Tell me the current traffic situation on the way to Silk Board Junction.",
        "Find the nearest EV charging station around RVCE campus.",
        "Is there an auto-rickshaw stand near RVCE Hostel Block A?",
        "Initiate automatic parallel parking for this spot.",
        "Show me alternative routes to Bannerghatta Road.",
        "How far is the RVCE Sports Complex from here?"
      ],
      "responses": [
        "Navigating to {destination}. You'll reach in approximately {time}, covering {distance}.",
        "Reversing your current route now. Please follow the instructions to head back.",
        "Here are a few options for {destination}. The quickest route with moderate traffic will take about {time}.",
        "The nearest {facility/point_of_interest} is {distance} away at {location}. Shall I set it as your destination?",
        "I'm recalculating the route to {destination}, considering current traffic. Your new estimated arrival time is {ETA}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I get to the CSE Department from the RVCE Main Gate?",
        "Guide me to the RVCE Central Canteen.",
        "Where is the RVCE Auditorium?",
        "Is the RVCE Boys Hostel to the left or right after the main entrance?",
        "Show me the path to the RVCE Library.",
        "What's the quickest way to reach the Mechanical Department from the admin block at RVCE?",
        "Where can I find parking near the RVCE ECE Department?",
        "What's the fastest route to RVCE from Electronic City right now?",
        "How much time will it take to reach RVCE from Koramangala with current traffic?",
        "Guide me to RVCE from Majestic Bus Stand.",
        "Show me the route from RVCE to M.G. Road.",
        "Are there any traffic jams on the way to RVCE from Jayanagar?",
        "What's the current traffic situation near Silk Board junction?",
        "How long to reach Indiranagar from Marathahalli with current traffic?",
        "Are there any detours on Mysore Road towards Kengeri?",
        "Start navigation to Cubbon Park.",
        "What's my estimated arrival time if I leave for Manyata Tech Park now?",
        "Show me alternative routes to Bangalore Airport avoiding toll roads.",
        "Is there heavy traffic on Outer Ring Road near EcoSpace?",
        "Tell me the best way to reach Lalbagh Botanical Garden from here."
      ],
      "responses": [
        "Navigating to {destination}. The journey is estimated to take {travel_time} with current traffic conditions.",
        "Here's the quickest route to {destination}. Please check the map for real-time traffic updates.",
        "Showing you the path to {location}. It's approximately {distance} from your current position.",
        "The traffic on your route to {destination} is currently {traffic_status}. An alternative route is available, adding {extra_time} to your journey. Would you like to switch?",
        "Okay, I'll guide you to {destination}. Estimated arrival time is {ETA}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the current traffic situation on Mysore Road towards Kengeri?",
        "How long until we reach Phoenix Marketcity, Whitefield?",
        "Are there any toll booths on the route to Kempegowda International Airport?",
        "Show me an alternate route to Jayanagar 4th Block to avoid this congestion.",
        "What's the ETA to Indiranagar 100 Feet Road from our current location?",
        "Recalculate the route to Majestic, avoiding narrow streets.",
        "Is this the most efficient way to get to Bannerghatta Road?",
        "Tell me my next three turns on this route to Koramangala.",
        "Find the nearest parking garage to MG Road.",
        "Can you guide me to the nearest petrol pump from our current location?",
        "Where is the RVCE Information Science Department located?",
        "Navigate me to the RVCE Main Canteen from the Library.",
        "What's the quickest path to the Boys' Hostel from the RVCE main gate?",
        "Show me the way to the RVCE Main Auditorium.",
        "Guide me to the ECE Department block within RVCE campus.",
        "Is there any visitor parking near the RVCE Girls' Hostel?",
        "How far is Raja Rajeshwari Nagar from RVCE campus?",
        "Activate reverse parking assist for this spot near the Mechanical Block.",
        "What's the route from RVCE campus to Nayandahalli Metro Station?",
        "Tell me about the traffic on the way from RVCE to Global Village Tech Park."
      ],
      "responses": [
        "Starting navigation to {destination}. You'll arrive in approximately {ETA} minutes.",
        "The current route to {destination} is showing {traffic_level} traffic. An alternative via {alternative_road} could save you {time_saved} minutes. Would you like to switch?",
        "{RVCE_location_description}. It's about {distance} from your current position. I can plot a route for you.",
        "Activating reverse assist. Please ensure your surroundings are clear. Guiding you now.",
        "Your next turn is a {turn_direction} onto {street_name} in {distance}. The overall route is {route_status}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest route to RVCE Main Gate from Majestic Bus Stand?",
        "Navigate to RVCE Boys Hostel.",
        "How do I get to the CSE Department from the RVCE Admin Block?",
        "Find the nearest parking lot to the RVCE Library.",
        "What's the current traffic situation on Mysore Road near RVCE?",
        "How much longer until I reach the RVCE Auditorium?",
        "Tell me my next turn on this route to the RVCE Canteen.",
        "Are there any alternative routes to Electronic City from RVCE?",
        "What's the ETA to RVCE Girls Hostel from my current location in Kengeri?",
        "Guide me to the RVCE Canteen from the ECE Department.",
        "Start automatic parallel parking.",
        "Show me the drive-through ATMs along this route to Banashankari.",
        "Can you help me reverse out of this tight spot near the RVCE Sports Complex?",
        "Set my navigation preferences to avoid unpaved roads when navigating within RVCE.",
        "Is there a faster way to Global Village Tech Park from RVCE right now?",
        "What's the speed limit on this road leading to RVCE Nagarabhavi campus?",
        "Direct me to the main exit of RVCE campus from the hostel area.",
        "How far is the RVCE Auditorium from the college main gate?",
        "Start navigation to Rajarajeshwari Nagar from RVCE, avoiding tolls.",
        "Tell me when to make the next turn to reach the RVCE Admin Block."
      ],
      "responses": [
        "Navigating to {destination}. Expect to arrive in approximately {ETA_time}.",
        "Your next turn is {direction} onto {street_name} in {distance}.",
        "Traffic on the route to {location} is currently {traffic_condition}. Would you like to check alternative routes?",
        "Activating {parking_type} parking assist. Please proceed slowly and follow the guidance on your screen.",
        "Understood. I'll guide you to {building_name} within the RVCE campus. Please follow the directions displayed."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate.",
        "What's the quickest route from RVCE to Indiranagar right now?",
        "How do I get to the RVCE CSE Department from the Electrical Engineering block?",
        "Is there heavy traffic on Bannerghatta Road towards IIM-B?",
        "Guide me for parallel parking in this spot.",
        "Show me the way to the RVCE Canteen from the Central Library.",
        "What's my estimated time of arrival at Kempegowda International Airport from RVCE?",
        "Find an available parking spot near the RVCE Mechanical Department.",
        "Engage auto-parking.",
        "How far is the RVCE Auditorium from the ECE Department's entrance?",
        "Direct me to the nearest exit from the RVCE campus towards Mysore Road.",
        "What's the traffic like on Outer Ring Road near Silk Board?",
        "Can you help me reverse into this tight parking space?",
        "Navigate to Cubbon Park, avoiding tolls.",
        "Show me the route to the RVCE Sports Ground from the MBA block.",
        "Is there enough space to make a U-turn safely here?",
        "Find the fastest way to RVCE from Whitefield.",
        "Where is the Placement Office within RVCE?",
        "What's the current traffic situation on the road leading to Global Village Tech Park from RVCE?",
        "Guide me to the RVCE Hostel Block A from the Main Gate."
      ],
      "responses": [
        "Starting navigation to {destination}. Current ETA is {time} minutes.",
        "Found the fastest route to {destination}. Traffic looks {status} on this path.",
        "Engaging parking guidance. Please be ready to take control if needed.",
        "To reach {destination} within the RVCE campus, head {direction} and you'll find it on your {side}.",
        "Checking the current route conditions to {destination}. Expect {traffic_level} traffic, adding about {extra_time} to your journey."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to Electronic City via elevated expressway.",
        "What's the fastest route to Indiranagar right now?",
        "Take me to Cubbon Park, avoiding tolls.",
        "Find the quickest way to Kempegowda International Airport from here.",
        "I need directions to Jayanagar 4th Block.",
        "Drive me to Manyata Tech Park.",
        "How do I get to the RVCE Main Gate from Mysore Road?",
        "Show me the path to the RVCE Girls Hostel from the Mechanical Block.",
        "Guide me to the RVCE Auditorium from the main campus entrance.",
        "I need directions to the RVCE Computer Science Block.",
        "Where is the RVCE Canteen located on campus?",
        "Navigate to the RVCE Library.",
        "Find the nearest exit from RVCE campus.",
        "Take me back to RVCE Main Gate from Silk Board Junction.",
        "Can you reverse my current route to the starting point?",
        "What's the current traffic situation on Mysore Road towards RVCE?",
        "How long will it take to reach Koramangala from here with current traffic?",
        "Are there any alternative routes to Whitefield avoiding heavy traffic?",
        "Show me the next turn on my way to the RVCE Boys Hostel.",
        "Update me on the ETA to Electronic City."
      ],
      "responses": [
        "Navigating to {destination}. The estimated travel time is {travel_time} with {traffic_condition}.",
        "Found the quickest route to {destination}. Starting turn-by-turn guidance now.",
        "The traffic ahead is {traffic_status}. An alternative route via {alternative_road} could save you {time_saved} minutes.",
        "You are currently {distance} from {destination}. Your next instruction is {instruction}.",
        "Understood. Initiating route back to {destination}. Please confirm."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate.",
        "Take me to the Computer Science Department at RVCE.",
        "Show me the shortest way to the RVCE Hostel Mess.",
        "Guide me to the RVCE Auditorium.",
        "Where is the Electrical Engineering Block within RVCE?",
        "Find the fastest route from RVCE to Majestic Bus Stand.",
        "How do I get to JP Nagar 1st Phase from RVCE?",
        "What's the traffic situation on Mysore Road right now?",
        "What's my ETA to reach RVCE Library?",
        "Are there any diversions on the route to Electronic City?",
        "Take me to Gopalan Arcade Mall, avoiding tolls if possible.",
        "Can you find a parking spot near the RVCE Canteen?",
        "How long will it take to reach Koramangala from here?",
        "Show me an alternate route to Indiranagar.",
        "Navigate back to RVCE Main Gate from my current location.",
        "What's the current speed limit on this road?",
        "Is there heavy traffic near RVCE ring road?",
        "Which way to the new research block at RVCE?",
        "Start navigation to Lal Bagh, avoiding highways.",
        "Tell me the next turn I need to take to reach RVCE Sports Complex."
      ],
      "responses": [
        "Starting navigation to {destination}. Estimated arrival in {time}.",
        "Found the quickest route to {destination}, avoiding current traffic. Proceed as directed.",
        "Your ETA to {destination} is {time}, with {traffic_level} traffic ahead.",
        "Navigating back to {destination}. Please follow the reverse route instructions.",
        "Searching for parking near {location}. I found a spot {distance} from your destination."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the current traffic situation to RVCE Main Gate from MG Road?",
        "How long will it take to reach RVCE Hostel Block A from Electronic City?",
        "Show me the fastest route from RVCE CSE Department to RVCE Canteen.",
        "Guide me to the RVCE Auditorium from the Library building.",
        "Is there an alternate route to RVCE from Mysore Road to avoid congestion?",
        "Start reverse parking assistance for this spot.",
        "What's the estimated time to Cubbon Park from RVCE right now?",
        "Navigate from RVCE Sports Ground to the Dean's Office within the campus.",
        "Tell me about the next turn on the route to Lalbagh from RVCE.",
        "How far is the RVCE Mechanical Department from the Main Gate, walking or driving?",
        "What are the road conditions like on the way to Koramangala from RVCE?",
        "Find the quickest way to RVCE from Bangalore International Airport, considering current traffic.",
        "Show me a route to Forum Mall from RVCE, avoiding toll roads if possible.",
        "How do I get to the RVCE Administrative Block from the visitor's parking area?",
        "What's the best route to UB City from RVCE at this time of day, with less traffic?",
        "Guide me specifically to the RVCE Main Gate entrance.",
        "Can you show me the full route overview for my trip to Indiranagar from RVCE?",
        "Is there any significant traffic near the RVCE campus main entrance right now?",
        "What's the quickest way to reach RVCE Hostel from RVCE CSE Dept, considering walking paths?",
        "Help me reverse into that tight parking bay."
      ],
      "responses": [
        "The estimated travel time to {destination} is {time}, with {traffic_condition} traffic. Would you like to start navigation?",
        "Starting navigation to {destination}. It's approximately {distance} away, taking about {time} under current conditions.",
        "Activating reverse parking assistance. Please proceed slowly; I'll guide you into the spot.",
        "Okay, the fastest route to {destination} avoids major congestion. Your next turn is a {direction} in {distance} meters.",
        "Here's the route overview to {destination}. You'll be taking {road_name} for the majority of the trip. Traffic appears {traffic_level}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest way to RVCE Main Gate from Koramangala right now?",
        "How long will it take to reach Electronic City from here with current traffic?",
        "Guide me from the RVCE Main Gate to the CSE Department.",
        "Is there heavy traffic on Mysore Road towards RVCE?",
        "Show me alternative routes to reach Jayanagar 4th Block.",
        "Estimate my arrival time at Kempegowda International Airport if I leave RVCE now.",
        "Where's the closest parking spot near the RVCE Auditorium?",
        "Initiate automatic parallel parking.",
        "Help me reverse safely into this narrow spot.",
        "What's the current traffic situation on the Outer Ring Road near Marathahalli?",
        "How far is the RVCE Canteen from the Library Block?",
        "Is the route to MG Road clear of major congestion?",
        "Show me the shortest route to Lalbagh Botanical Garden.",
        "What's the distance from Silk Board Junction to RVCE Main Gate?",
        "Are there any road closures or diversions near Cubbon Park today?",
        "Find a route to RVCE Hostel from Majestic Bus Stand, avoiding tolls.",
        "How many turns are left until I reach the RVCE Sports Complex?",
        "Can you find available parking near my destination in Indiranagar 100 Feet Road?",
        "What's the typical travel time to RVCE during morning rush hour from Domlur?",
        "Suggest the most efficient route from RVCE to Bangalore University Jnanabharathi Campus."
      ],
      "responses": [
        "Calculating the optimal route to {destination}. It's {distance} and should take around {estimated_time} with {current_traffic} traffic.",
        "The current traffic on {road_segment} is {traffic_level}. I can provide an alternative route if you'd like.",
        "I've identified several parking options near {destination}. The closest one is {parking_distance} away with {parking_availability} spots.",
        "Initiating automatic {parking_type} parking. Please ensure the area is clear and follow the prompts on your screen.",
        "Engaging reverse assist. Please maintain a slow speed and I will guide the steering. Watch your surroundings."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Start navigation to RVCE Main Gate.",
        "What's the fastest route from RVCE to Indiranagar?",
        "How do I get to the RVCE Computer Science Department?",
        "Is there an alternative route to RVCE from Mysore Road due to heavy traffic?",
        "Guide me to the RVCE Hostel Block B.",
        "What's the current traffic situation near Nayandahalli signal?",
        "Where is the RVCE Canteen?",
        "Initiate automatic parking for this spot.",
        "How much longer until I reach RVCE from Bannerghatta Road?",
        "Can you help me reverse park into this bay?",
        "Show me the way to RVCE Auditorium.",
        "What's my next turn on the way to RVCE from Kengeri?",
        "Find the nearest parking to RVCE Administrative Block.",
        "Stop navigation to RVCE.",
        "Are there any tolls on the route to RVCE from Hebbal?",
        "What's the quickest path to RVCE Sports Complex from the Main Gate?",
        "What's my current location on the RVCE campus?",
        "Start auto-reverse out of this driveway.",
        "What's the ETA to RVCE from Majestic, considering current traffic?",
        "Navigate to RVCE Mechanical Engineering Department."
      ],
      "responses": [
        "Starting navigation to your destination. Estimated arrival in {X} minutes.",
        "Your current ETA is {time}. There is {traffic_condition} traffic ahead on your route.",
        "Engaging automatic parking. Please ensure your surroundings are clear.",
        "Guiding you for the reverse maneuver. Proceed slowly and check your mirrors.",
        "Showing you the best route to {destination}. It's {distance} away."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate from Marathahalli.",
        "How do I get to the RVCE CSE Department from the Admin Block?",
        "What's the fastest way to Electronic City from here?",
        "Find me a route to Cubbon Park, avoiding tolls if possible.",
        "Guide me to the RVCE Girls Hostel.",
        "Show me the path to the RVCE Canteen from the Library.",
        "Are there any traffic delays on the way to Indiranagar?",
        "What's my estimated arrival time at RVCE Auditorium?",
        "Take me to Vidhana Soudha from RVCE.",
        "What's the next turn I need to take?",
        "Can you find a parking spot near the RVCE Sports Complex?",
        "Direct me to the nearest petrol station on the way to Koramangala.",
        "Start navigation to Kempegowda International Airport.",
        "How far is the RVCE Mechanical Engineering Department?",
        "Resume my last navigated route to RVCE Boys Hostel.",
        "Is there an alternative route to RVCE from Majestic with less traffic right now?",
        "Where is the RVCE Electrical Engineering Block?",
        "Set my destination to Jayanagar 4th Block.",
        "How do I get out of this RVCE parking lot?",
        "Tell me the current traffic conditions towards MG Road."
      ],
      "responses": [
        "Starting navigation to {destination}. The estimated travel time is {duration} with {traffic_condition} traffic.",
        "Okay, guiding you to {RVCE_campus_location}. Please follow the directions on your screen.",
        "Your estimated arrival time at {destination} is {ETA}. There are {distance_remaining} km remaining, and the next turn is {direction} onto {street_name}.",
        "Yes, there's an alternative route to {destination} avoiding {issue} that could save you {time_saved} minutes. Would you like to take it?",
        "To assist with your parking maneuver, please reverse slowly. I will indicate obstructions on your screen."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Drive me to RVCE Main Gate.",
        "What's the fastest route to Koramangala from here?",
        "Navigate to RVCE CSE Department.",
        "Is there a quicker way to reach Marathahalli right now?",
        "How do I get to the RVCE Central Canteen from the Library?",
        "Show me directions to the nearest petrol pump from RVCE campus.",
        "What's the estimated time of arrival at UB City?",
        "Take me to the RVCE Boys' Hostel.",
        "Are there any traffic jams on the way to Electronic City?",
        "Find the shortest path from Jayanagar 4th Block to RVCE.",
        "Guide me to the RVCE Auditorium.",
        "Are there any tolls on the route to Kempegowda International Airport?",
        "Start navigation to RVCE Sports Complex.",
        "Can you reroute me to avoid this traffic near Silk Board?",
        "What's the next turn on the way to M.G. Road?",
        "How far is the RVCE Medical Center from here?",
        "Give me a route update to Indira Nagar.",
        "Drive to the RVCE parking lot near the Mechanical Department.",
        "Take me back to the previous main road.",
        "Optimize my current route for minimum travel time."
      ],
      "responses": [
        "Starting navigation to {destination}. The fastest route is {route_details}, expected arrival at {time}.",
        "You are currently {distance} from {location}. Traffic seems {traffic_level}, estimated arrival time is {eta}.",
        "Guiding you to {RVCE_campus_point} on campus. Please proceed {direction} for {distance}.",
        "Rerouting now to avoid heavy traffic near {area}. Your new ETA is {new_eta}.",
        "Understood. Taking you back to the previous major intersection. Prepare to make a {turn_direction} turn."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the best route to RVCE Main Gate from Jayanagar 4th Block right now?",
        "Guide me to the RVCE CSE Department from the main entrance.",
        "How do I get to the Boys Hostel from the RVCE Auditorium?",
        "Is there any traffic on Mysore Road towards Kengeri?",
        "Find the nearest parking spot to the RVCE Library.",
        "What's the estimated time of arrival at Global Village Tech Park from here?",
        "Show me the fastest way to the RVCE Canteen from the Mechanical Department.",
        "Are there any road closures near Banashankari Temple today?",
        "Are there any speed cameras on the road from RVCE to Banashankari?",
        "Tell me my current speed limit near RVCE on the main road.",
        "Direct me to the RVCE Sports Complex.",
        "Are there any tolls on the route to Electronic City from RVCE?",
        "What's the traffic like near Gopalan Arcade Mall?",
        "Can you find an alternative route to RV Road to avoid this jam?",
        "Where is the RVCE Girls Hostel relative to the ECE Department?",
        "Guide me to the RVCE Bus Stop from the Library.",
        "What's my next turn if I'm heading towards Rajarajeshwari Nagar from RVCE?",
        "Show me nearby petrol stations on the way to BTM Layout from RVCE.",
        "Can you show me the quickest walking path from RVCE CSE Department to the Canteen?",
        "How far is the RVCE Dental College from the Engineering campus main gate?"
      ],
      "responses": [
        "Navigating to {destination}. The estimated travel time is {time} with current traffic.",
        "The best route from your current location to {destination} is {distance} via {road_name}. Please follow the signs for {next_direction}.",
        "Currently, there is heavy traffic on {road_name} towards {direction}, causing a {delay} minute delay. Would you like to see an alternative route?",
        "You are currently at the {current_location}. To reach {destination}, head {direction} for {distance} and then turn {turn_direction}.",
        "I found a parking spot near the {landmark} at {location}. Directions are on your screen."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Show me the fastest way to the RVCE main gate from my current location.",
        "Navigate to the RVCE Computer Science department.",
        "Where is the RVCE Central Canteen located?",
        "Give me driving directions to the RVCE Boys Hostel.",
        "What's the quickest route from RVCE to MG Road, Bangalore?",
        "How do I get to Kengeri Metro Station from the RVCE campus?",
        "Start navigation to Electronic City from here, avoiding tolls.",
        "Tell me the estimated time of arrival if I drive to Indiranagar right now.",
        "Are there any alternative routes to Cubbon Park from my current position?",
        "What's the traffic situation like on the route to Silk Board junction?",
        "Can you show me the way to the RVCE Auditorium?",
        "Guide me to the nearest parking area within RVCE campus, close to the ECE block.",
        "Reverse my current route to go back to Jayanagar 4th Block.",
        "I need to get to Bangalore International Airport from RVCE. Suggest the best route.",
        "Navigate to the RVCE Sports Complex.",
        "Is the current route to Manyata Tech Park the fastest one?",
        "What's the speed limit on Mysore Road near RVCE?",
        "Show me the path to the RVCE administrative block.",
        "Start auto-navigation to Lalbagh Botanical Garden.",
        "Tell me the distance and estimated time to reach RVCE from Koramangala."
      ],
      "responses": [
        "Navigating to {destination}. Your estimated arrival time is {ETA}.",
        "Displaying the quickest route to {destination}. It will take approximately {time}.",
        "Reversing your current path. The new route back to {location} is now active.",
        "Based on current traffic, the recommended route to {destination} is {route_details}. It includes {route_features}.",
        "I've found {number} alternative routes. The fastest one to {destination} avoids {obstacles} and takes {time}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I drive from the RVCE Main Gate to the Mechanical Department building?",
        "Guide me to the RVCE Girls Hostel from the Canteen.",
        "What's the best way to get to the RVCE Auditorium from the CSE Block parking?",
        "Show me the route to the RVCE Library from the Principal's office.",
        "Is there a quicker path from the Sports Complex to the RVCE Biotech Department?",
        "Navigate to RVCE Main Gate from Marathahalli.",
        "What's the current traffic like from Electronic City to RVCE?",
        "Give me directions from RVCE campus to Global Village Tech Park.",
        "How long will it take to reach RVCE from Jayanagar 4th Block right now?",
        "Find the fastest route to RVCE from Koramangala, avoiding tolls.",
        "What's the current road condition on Outer Ring Road near Silk Board?",
        "Are there any traffic jams on Mysore Road towards Kengeri?",
        "Show me alternative routes to Bengaluru Airport from Indiranagar.",
        "What's my estimated time of arrival at MG Road with current traffic?",
        "Give me the next three turn-by-turn directions to reach Lalbagh Botanical Garden.",
        "Activate auto-park for this parallel spot.",
        "Can you help me reverse into this bay at Phoenix Marketcity parking?",
        "Start autonomous driving mode for the highway stretch to Tumakuru.",
        "Which lane should I drive in to exit towards Banashankari on NICE Road?",
        "Tell me the name of the road I'm currently driving on near RVCE."
      ],
      "responses": [
        "Initiating {feature} mode. Please be prepared to take over if needed.",
        "Currently, your estimated time of arrival at {destination} is {time}, covering {distance}. Traffic conditions are {condition}.",
        "The system recommends {lane_recommendation} to best navigate towards {destination}.",
        "To reach {destination}, proceed as follows: {next_instruction}. The total remaining distance is {distance}.",
        "You are currently on {current_road}. The fastest route shows {route_details} to avoid major delays."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate.",
        "Take me to the Computer Science Department at RVCE.",
        "How do I get to the RVCE Boys' Hostel from here?",
        "Find the fastest route from RVCE to Kengeri Metro Station.",
        "What's the traffic like on Mysore Road heading towards RVCE?",
        "Show me the way to the RVCE Canteen.",
        "Give me directions to the RVCE Auditorium.",
        "I need to go to Global Village Tech Park, start navigation from RVCE.",
        "What's the ETA to Indiranagar from my current location near RVCE?",
        "Are there any alternative routes to Bannerghatta Road?",
        "How do I reverse my route and head back to the RVCE main entrance?",
        "Where is the nearest parking area within RVCE campus?",
        "Guide me to the RVCE Library from the Electrical Engineering block.",
        "What's the next turn on the way to M.G. Road?",
        "Set my navigation preferences to avoid tolls on the way to Majestic.",
        "Start driving directions to Jayanagar 4th Block.",
        "What's the current traffic situation near Nayandahalli signal?",
        "Take me back to the main gate of RVCE.",
        "How much longer until I reach Forum Mall Koramangala from RVCE?",
        "Show me the quickest way to RVCE's sports complex."
      ],
      "responses": [
        "Starting navigation to {destination}. The current ETA is {time}.",
        "Found the best route to {destination}. It will take approximately {duration} with {traffic_level} traffic.",
        "To get to {RVCE_campus_location} within the RVCE campus, head {direction} from your current position.",
        "You're currently on track. The next turn is {turn_instruction}. There are no significant delays reported.",
        "Re-routing to take you back to {previous_point_or_destination}. Please follow the updated directions."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I get to the RVCE CSE department from the main gate?",
        "Navigate to the RVCE Main Auditorium now.",
        "What's the quickest way to the RVCE Girls' Hostel from the ECE department?",
        "Show me the route to the RVCE Food Court from the Library.",
        "Are there any parking spots near the RVCE Library?",
        "Guide me to the RVCE Sports Complex.",
        "How far is the Mechanical Department from the Boys' Hostel in RVCE?",
        "Take me to Global Village Tech Park from RVCE.",
        "Find the fastest route from RVCE to Mysore Road.",
        "Directions from RVCE to Kengeri Satellite Town.",
        "Guide me to BGS Global Hospital from RVCE.",
        "What's the traffic like on the way to Raja Rajeshwari Nagar from RVCE right now?",
        "Navigate to Electronic City from RVCE, avoiding tolls.",
        "Show me the best route to Kempegowda International Airport from RVCE.",
        "How do I get back to RVCE Main Gate from my current location near MG Road?",
        "Go back to the previous turn on the way to Indiranagar.",
        "What's my estimated time of arrival at RVCE from my current position near Cubbon Park?",
        "Are there any alternative routes to RVCE from here, avoiding Bannerghatta Road?",
        "Tell me the next two turns on my way to Lalbagh Botanical Garden.",
        "Cancel current navigation to Marathahalli and take me back home (RVCE Boys' Hostel)."
      ],
      "responses": [
        "Navigating to {destination}. You'll arrive in approximately {ETA} minutes, covering {distance} kilometers.",
        "Okay, re-routing you back towards {previous_point_or_home}. Please proceed carefully.",
        "Calculating the best route to {destination} considering current traffic conditions. There are {number} alternative options available.",
        "Your next turn is {direction} onto {street_name} in {distance_to_turn} meters. Traffic ahead looks {traffic_condition}.",
        "Guiding you to {campus_landmark} within RVCE campus. It's a short {distance} walk/drive."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate.",
        "How do I get to the CSE Department from here on campus?",
        "What's the fastest route from RVCE to Kengeri Satellite Town?",
        "What's the estimated time to reach RVCE Boys Hostel from Electronic City right now?",
        "Is there heavy traffic on the way to RVCE from Silk Board?",
        "Find the closest parking near the RVCE Canteen.",
        "Take me to the RVCE Auditorium.",
        "How far is the RVCE Library from the ECE Department?",
        "Give me directions to Gopalan Arcade Mall from RVCE.",
        "Show me an alternative route to Bengaluru Airport from RVCE.",
        "Activate reverse parking assist.",
        "Can you tell me the current traffic situation on Mysore Road towards RVCE?",
        "How long will it take to drive from RVCE to JP Nagar 3rd Phase?",
        "Navigate to the RVCE Girls Hostel.",
        "Where is the RVCE Mechanical Department located on campus?",
        "What's the quickest way from RVCE to Global Village Tech Park?",
        "Show me the current route details for my trip to MG Road.",
        "Is there an auto-parking option available for this spot?",
        "Reverse into that parallel parking space, please.",
        "What's the current traffic like from RVCE to Indiranagar?"
      ],
      "responses": [
        "Starting navigation to {destination}. The estimated travel time is {time} with current traffic.",
        "Sure, to reach {destination} within RVCE, proceed {direction} for {distance}, it will be on your {side}.",
        "Checking route to {destination}. The current traffic on {road_name} is {traffic_condition}, ETA is {time}.",
        "Activating {feature} mode. Please follow the instructions on your screen for safe maneuvering.",
        "The distance to {destination} is approximately {distance}. Would you like to see alternative routes or parking options?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I get to the CSE department from the RVCE main gate?",
        "Show me the way to RVCE Girls Hostel from the Mechanical Engineering block.",
        "Where is the RVCE canteen? Is it near the Admin Block?",
        "Navigate to the RVCE Auditorium. Which gate should I use?",
        "What's the quickest path to the Innovation Centre within RVCE from the sports ground?",
        "Is there visitor parking available near the RVCE Library building?",
        "Give me directions from RVCE Main Gate to Global Village Tech Park.",
        "What's the traffic like from RVCE to Kengeri Satellite Town?",
        "How far is Gopalan Arcade Mall on Mysore Road from RVCE, and how long will it take?",
        "Navigate to Rajarajeshwari Nagar arch from RVCE, avoiding any narrow roads.",
        "Find the fastest route from RVCE to the NICE Road junction towards Tumakuru.",
        "Take me to Manyata Tech Park from my current location in South Bangalore.",
        "What's the ETA to Electronic City Phase 1 during evening peak hours?",
        "Is there heavy traffic on Outer Ring Road near Marathahalli bridge right now?",
        "Find the shortest route to Lalbagh Botanical Garden from Indiranagar.",
        "Avoid tolls on the way to Kempegowda International Airport from Jayanagar.",
        "Where's the nearest petrol bunk on the way to Koramangala from Basavanagudi?",
        "How long will it take to reach Bannerghatta National Park from M.G. Road at noon?",
        "Show me parking options near Commercial Street. Any reverse parking spots?",
        "I need to drive to Vidhana Soudha. What's the best route for office hours?"
      ],
      "responses": [
        "Navigating to {destination}. The journey is approximately {distance} and will take {time} with current traffic.",
        "Understood. I've found the fastest route to {destination}. Would you like to avoid tolls or highways?",
        "Your estimated time of arrival at {destination} is {time}. There is {traffic_condition} on your current route.",
        "Searching for parking near {location}. I see an available spot that requires a reverse park maneuver at {address}.",
        "Recalculating your route to {destination} due to unexpected traffic. Your new ETA is {new_time}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Show me the best route to UB City from my current location.",
        "Navigate to Koramangala 8th Block.",
        "What's the fastest way to Kempegowda International Airport right now?",
        "Is there heavy traffic on Mysore Road heading towards RVCE?",
        "Guide me to the RVCE Computer Science Department.",
        "Take me to the RVCE Main Gate.",
        "Where is the RVCE Boys Hostel?",
        "Find the nearest parking spot to the RVCE Auditorium.",
        "How do I get to the RVCE Canteen from the Mechanical Block?",
        "What's my ETA to Electronic City from RVCE?",
        "Show me an alternative route to Jayanagar, avoiding tolls.",
        "Start automatic parking assistance.",
        "What's the current traffic delay on my route to Manyata Tech Park?",
        "Navigate from RVCE to Kengeri Metro Station.",
        "Can you show me the way to the RVCE Library?",
        "Is there a shortcut to the RVCE Admin Block?",
        "How do I reverse safely into that spot?",
        "Update my route to include a stop at a petrol pump near RVCE.",
        "What's the quickest way from RVCE to Global Village Tech Park right now?",
        "Navigate to the Indian Institute of Science (IISc)."
      ],
      "responses": [
        "Starting navigation to {destination}. The estimated travel time is {time}.",
        "I've found the quickest route. There's {traffic_level} traffic ahead, but you're on the best path.",
        "Activating reverse parking assist. Please check your surroundings and follow the on-screen prompts.",
        "There's a significant delay on your current route to {destination}. Would you like me to suggest an alternative route that avoids the traffic?",
        "Guiding you to {RVCE_campus_location} within RVCE. You are approximately {distance} away."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to MG Road, Bangalore.",
        "What's the fastest route to Electronic City from here?",
        "Show me the current traffic conditions on Outer Ring Road.",
        "How much longer until I reach Cubbon Park?",
        "Find an alternative route to Indiranagar, avoiding any congested areas.",
        "Guide me to the RVCE main gate.",
        "Take me to the RVCE CSE Department from my current location.",
        "Where is the RVCE Boys' Hostel?",
        "What's the best way to get from RVCE to Forum Mall, Koramangala?",
        "Direct me to the RVCE Auditorium from the Library building.",
        "Is there any parking available near the RVCE Canteen?",
        "Show me the route back to my starting point from RVCE.",
        "Can you automatically find a new route if there's a major accident ahead?",
        "What's the next turn I need to take?",
        "Am I heading in the right direction for Lalbagh Botanical Garden?",
        "Recalculate the route to Manyata Tech Park, I want to go via Hebbal.",
        "What's the estimated time of arrival at RVCE Mechanical Department?",
        "Show me all available petrol stations on my current route to Jayanagar.",
        "Set navigation preferences to automatically avoid narrow streets within RVCE campus.",
        "Guide me to the RVCE Sports Complex from the ECE Department."
      ],
      "responses": [
        "Navigating to {destination}. Expect to arrive in approximately {time} covering {distance}.",
        "Your current route to {destination} is clear. The next turn is {direction} on {street_name}.",
        "Recalculating your route to {destination} due to heavy traffic. The new ETA is {time}.",
        "Directing you to {RVCE_location} within the RVCE campus. Please refer to the map on your display.",
        "To navigate back to your starting point, I can reverse the current route or guide you to a new destination. Which would you prefer?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to UB City, please.",
        "What's the fastest route to Electronic City?",
        "How long will it take to reach Koramangala from here?",
        "Show me an alternative route to Majestic Bus Stand.",
        "Are there any traffic jams on the way to Indiranagar?",
        "Give me directions to Lalbagh Botanical Garden.",
        "Start navigation to Cubbon Park.",
        "Is there a petrol pump on the way to Jayanagar 4th Block?",
        "What's the current estimated time of arrival at Bengaluru Airport?",
        "Reroute me to Forum Mall, Koramangala.",
        "Navigate from my current location to RVCE Main Gate.",
        "Take me to the RVCE Computer Science Department.",
        "How do I get to the RVCE Central Canteen from here?",
        "Show me the way to RVCE Girls' Hostel Block B.",
        "What's the quickest path to the RVCE Auditorium?",
        "Give me directions to the Mechanical Engineering Block at RVCE.",
        "Navigate from RVCE to Kengeri Bus Terminal.",
        "Find the route from RVCE to Global Village Tech Park.",
        "How long from RVCE to Rajarajeshwari Nagar Arch?",
        "Can you guide me in reverse to back into this parking spot near RVCE Main Gate?"
      ],
      "responses": [
        "Starting navigation to {destination}. You should arrive in approximately {time}.",
        "Calculating the optimal route to {destination}. I'll show you the details shortly.",
        "Your current ETA to {destination} is {time}. There's {traffic_status} near {area}.",
        "Guiding you to {specific_location} within RVCE. Please follow the on-screen directions.",
        "Initiating reverse assistance. The rear camera view is now active. Please slowly back into the spot."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How much time will it take to drive from RVCE Main Gate to Electronic City right now?",
        "Initiate auto-park for this parallel spot near UB City.",
        "What's the fastest driving route from Koramangala to RVCE CSE Department?",
        "Show me the reverse camera view and guide me into this parking space at RVCE Hostel Block A.",
        "Is there a way to avoid the Silk Board traffic on my current route to RVCE?",
        "Engage auto-pilot for the stretch on Outer Ring Road towards Bangalore Airport.",
        "What's the next turn if I'm driving to RVCE Canteen from the main entrance?",
        "Can you help me reverse into that tight spot near RVCE Auditorium?",
        "How far is the RVCE Library from my current location near the Sports Complex?",
        "Suggest a scenic drive route from Cubbon Park back to RVCE.",
        "Are there any tolls on the route if I drive from Indiranagar to RVCE?",
        "Switch to auto-drive mode when we hit the elevated highway section near Electronics City.",
        "Provide an alternative driving route to Majestic that avoids Bannerghatta Road traffic.",
        "Guide me on reversing into the parking lot near RVCE Mechanical Block.",
        "What's the estimated time of arrival at Phoenix Marketcity if I drive from RVCE now?",
        "Is there enough space to safely reverse park here at Lal Bagh?",
        "Where is the nearest EV charging station on my driving route to RVCE Electrical Block?",
        "Activate 'Drive Mode' with sportier settings.",
        "How much longer until I reach the RVCE CSE Department from the Main Gate?",
        "Tell me about the traffic conditions on Mysore Road for my drive to RVCE."
      ],
      "responses": [
        "Analyzing the best driving route to {destination}, considering current traffic and your preferences.",
        "Engaging {mode} mode. Please follow the on-screen prompts for safe maneuvering.",
        "Your estimated time of arrival at {location} is {time}, covering {distance} via the fastest route.",
        "I'm showing you the reverse camera feed. Turn the wheel slightly to the {direction} to align with the spot.",
        "Found an alternative route to {destination} that avoids congestion and adds approximately {minutes} minutes to your drive. Would you like to switch?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE from Majestic Bus Stand.",
        "Show me the fastest route to Electronic City right now.",
        "How do I get to the CSE department from the main gate of RVCE?",
        "Activating reverse mode, can you guide me into this parking spot near RVCE Auditorium?",
        "What's the traffic situation like on Mysore Road towards Kengeri?",
        "Find an automatic parking spot near the RVCE Library.",
        "Take me to the RVCE Girls Hostel from the Canteen.",
        "What's the estimated time to reach Global Village Tech Park from here?",
        "Guide me to back out of this parking spot near the RVCE Canteen.",
        "Directions to Cubbon Park, avoiding Outer Ring Road.",
        "What's my current location and the next turn in this navigation?",
        "Is there any auto parking available around Jayanagar 4th Block?",
        "Can you show me the way to the Mechanical Engineering Department at RVCE?",
        "Update me on the traffic conditions on Kanakapura Road.",
        "Help me reverse out of this tight spot near the Admin Block at RVCE.",
        "Navigate to Indiranagar from RVCE main gate.",
        "What's the ETA to reach Kempegowda International Airport from my current position?",
        "Show me the path to the RVCE Sports Complex from the Boys Hostel.",
        "Find the quickest route to Koramangala from RVCE campus.",
        "Initiate auto-park sequence for this parallel spot."
      ],
      "responses": [
        "Starting navigation to your destination. Please follow the instructions on the screen.",
        "Analyzing the best route considering current traffic. Estimated time to destination: {time}.",
        "Activating reverse assistance. Please proceed slowly and follow the visual cues.",
        "Searching for available parking spots. Would you like me to guide you to the closest one?",
        "Here's the detailed route information for {destination}. There are {number} turns, with an estimated travel time of {time}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the best way to drive to RVCE from Electronic City right now?",
        "How long will it take to reach the RVCE Main Gate from MG Road with current traffic?",
        "Give me directions to the RVCE CSE Department from my current location.",
        "Can you show me the route to the RVCE Canteen from the Library?",
        "Is there a reverse route option to get back to Forum Mall from RVCE?",
        "What's the shortest driving route from RVCE Hostel Block A to the Auditorium?",
        "Check for any traffic delays on the way to Indiranagar from RVCE.",
        "I need to drive to Koramangala. Is there a route that avoids Silk Board junction?",
        "Find the quickest way to reach Bangalore International Airport from RVCE.",
        "How far is the RVCE Sports Ground from the Director's Office?",
        "Guide me to the nearest visitor parking lot within RVCE campus.",
        "Start navigation to Lal Bagh, please, showing me the auto-updates.",
        "What's the approximate driving time to BTM Layout from here, and is the route clear?",
        "Can you provide reverse driving directions to the RVCE Main Gate from UB City?",
        "I'm at the RVCE Main Gate. How do I get to the Biotechnology Department?",
        "Find me a driving route to Majestic without tolls from RVCE.",
        "Show me the current traffic situation on Bannerghatta Road near RVCE.",
        "What's the distance if I drive from RVCE to KR Market?",
        "Is there any alternate route to RVCE from Cubbon Park that's less congested?",
        "Guide me through the campus to the RVCE MCA Department."
      ],
      "responses": [
        "Starting navigation to {destination}. Estimated drive time is {time} with current traffic.",
        "Found the {route_type} route to {destination}. Would you like to begin driving instructions?",
        "Yes, I can provide reverse directions to {origin}. Displaying the route now.",
        "Checking current traffic conditions. The route to {destination} currently shows {traffic_info}.",
        "Guiding you to your destination. Please proceed as instructed on the map."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the current traffic on Mysore Road towards RVCE main gate?",
        "How much longer until I reach the RVCE ECE Block?",
        "Is there a faster way to get to RVCE CSE Department from Koramangala right now?",
        "Show me the route to RVCE Canteen from the hostel.",
        "What's my estimated arrival time at Vidhana Soudha, considering current traffic?",
        "Are there any speed cameras on this route to Manyata Tech Park?",
        "Initiate reverse parking assistance.",
        "Can you find a parallel parking spot and auto-park near RVCE Auditorium?",
        "What's the next turn on my way to RVCE Library?",
        "Tell me the distance remaining to RVCE Main Gate.",
        "Is this the quickest route to Whitefield from RVCE campus?",
        "Show me the rear camera view.",
        "Avoid tolls on the current route to Hebbal.",
        "What's the traffic situation on Outer Ring Road near Silk Board junction?",
        "Guide me to reverse into this bay near RVCE faculty parking.",
        "What's the shortest path to the RVCE Sports Complex from the Mechanical Block?",
        "Are there any detours or road closures on the way to Indiranagar from here?",
        "Activate automatic parking for this spot.",
        "How many kilometers until I reach RVCE Gate 2?",
        "Tell me the full route summary to Forum Mall from my current location."
      ],
      "responses": [
        "You are currently {distance} kilometers from {destination}. Your estimated arrival time is {eta_time}.",
        "The traffic ahead looks {traffic_condition}, which may add approximately {delay_time} minutes to your journey. Would you like an alternative route?",
        "Activating {parking_type} parking assistance. Please select the desired spot on your screen.",
        "Your next instruction is to {maneuver} in {distance_to_turn} meters, on your way to {destination}.",
        "Here is the detailed route summary to {destination}, avoiding tolls and showing current traffic conditions."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I drive to the RVCE CSE Department from the main gate?",
        "Guide me to the RVCE Hostel Block B.",
        "Where is the nearest RVCE parking lot from the Civil Engineering department?",
        "Can you help me reverse into this spot near the RVCE Canteen?",
        "Show me the best route to the RVCE Auditorium from the Library.",
        "What's the quickest way to walk to the RVCE Sports Ground from the MBA Block?",
        "Is there a shortcut to the RVCE Placement Cell from the ECE Department?",
        "Can you adjust my navigation to the RVCE Dean's office if there's a campus event blocking a path?",
        "Navigate to RVCE Main Gate from Silk Board junction.",
        "Take me to Koramangala from RVCE.",
        "What's the current traffic situation on the route from RVCE to Mysore Road Satellite Bus Stand?",
        "Find me the fastest route to Electronic City from RVCE, avoiding tolls if possible.",
        "How long will it take to reach Global Village Tech Park from RVCE?",
        "Guide me to Forum Mall, Koramangala.",
        "What's the next turn on my way to Cubbon Park?",
        "Are there any alternative routes to MG Road to avoid traffic?",
        "Find automatic parking near Phoenix Marketcity, Whitefield.",
        "What's my ETA to Indiranagar right now?",
        "Show me the best way to reverse park near this restaurant in Jayanagar.",
        "Can you automatically re-route me if there's an accident on the Outer Ring Road?"
      ],
      "responses": [
        "Starting navigation to {destination}. Your estimated arrival time is {estimated_time}.",
        "Confirming your request for {action} to {location}. Please follow the visual guidance on your screen.",
        "I've detected {traffic_condition} ahead. Rerouting automatically to save {time_saved} minutes. Your new ETA is {new_estimated_time}.",
        "Here's the current route information: You are {distance} from your next turn. Turn {direction} onto {street_name}.",
        "Activating intelligent parking assistance for reverse maneuver. Please proceed slowly, I will guide you."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to Electronic City, Bangalore.",
        "Find the fastest route to Lalbagh Botanical Garden.",
        "Take me to Orion Mall, Rajajinagar.",
        "How do I get to Cubbon Park from here?",
        "Show me directions to the RVCE Main Gate.",
        "Guide me to the RVCE Library building.",
        "Where is the Computer Science Department within RVCE campus?",
        "I need to go to the RVCE Boys' Hostel.",
        "Direct me to the RVCE Canteen.",
        "Find the RVCE Auditorium.",
        "What's the way to the nearest Metro Station from RVCE?",
        "Can you guide me while I reverse into this parking spot near RVCE?",
        "Reverse my current path for the last 500 meters.",
        "Undo the last turn I made and go back.",
        "Enable automatic rerouting if there's heavy traffic on the way to RVCE.",
        "Switch to eco-friendly route mode automatically for my trip to Majestic.",
        "What's the estimated time of arrival at Bengaluru International Airport?",
        "Are there any traffic jams on the way to Jayanagar?",
        "Tell me my next turn.",
        "Show me alternative routes to RVCE from my current location."
      ],
      "responses": [
        "Navigating to {destination}. The journey is estimated to take {time}.",
        "Understood. Guiding you in reverse now. Please drive slowly.",
        "Your route has been updated automatically due to traffic. Your new ETA is {new_eta}.",
        "The next turn is {direction} onto {street_name} in {distance}.",
        "I'm calculating alternative routes to {destination}. Would you like to see options on your screen?"
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest way to drive from Silk Board to RVCE?",
        "Give me turn-by-turn directions to the RVCE Main Gate.",
        "How do I get to the CSE Department from the RVCE Hostel Block A within RVCE campus?",
        "Navigate to RVCE's Mechanical Engineering Department.",
        "Show me the route from RVCE to Bannerghatta Road.",
        "Are there any traffic delays on the way to Electronic City from here?",
        "What's the current estimated time of arrival to Koramangala if I leave RVCE now?",
        "Tell me the next navigation instruction.",
        "Find the quickest route to the RVCE Auditorium from the Library.",
        "Is there a shorter way to reach RVCE from Mysore Road?",
        "Can you help me reverse into this parking spot near the RVCE Canteen?",
        "Show me the rear camera view for reversing.",
        "Initiate reverse parking guidance.",
        "Are there any obstacles behind me right now?",
        "Engage automatic parking near the RVCE Admin Block.",
        "Can you parallel park this car?",
        "What's the current ETA to RVCE from Majestic?",
        "Are there any tolls on the route to Bengaluru Airport from RVCE?",
        "Tell me about the traffic conditions on Outer Ring Road towards Marathahalli.",
        "Display alternative routes to RVCE if there's heavy traffic on the current one."
      ],
      "responses": [
        "Starting navigation to {destination}. The fastest route shows {traffic_status} traffic and an ETA of {time}.",
        "Engaging reverse parking assistance. Please follow the guidance on your screen for parking.",
        "Auto-parking sequence initiated. Please ensure the area is clear and follow system instructions.",
        "Your next instruction is to {turn_direction} onto {road_name} in {distance_or_time}. Current traffic is {traffic_status}.",
        "Calculating the optimal route within RVCE campus to {campus_location}. Please proceed {direction} for approximately {distance}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest route to Koramangala 5th Block from my current location?",
        "Navigate to RVCE Main Gate.",
        "Show me directions to the RVCE Computer Science Department from the parking lot.",
        "Is there heavy traffic on Mysore Road towards Kengeri?",
        "How do I get to the RVCE Canteen from the Electrical Department?",
        "Find the best route to Bengaluru International Airport.",
        "What's my estimated arrival time at Vidhana Soudha?",
        "Guide me to the RVCE Hostel Block A.",
        "Are there any petrol pumps on the way to Indiranagar from RVCE?",
        "Tell me the next turn on this route.",
        "Reverse my current navigation and take me back to the last major junction.",
        "What's the current traffic situation near Silk Board Junction?",
        "Show me alternative routes to Jayanagar 4th Block.",
        "Navigate to the RVCE Auditorium.",
        "How far is Art of Living International Center from RVCE?",
        "Is there a shortcut to Electronic City from here?",
        "What's the speed limit on this road?",
        "Take me to the RVCE Library.",
        "From RVCE, find the fastest way to Forum Mall, Koramangala.",
        "Can you display the entire route map for my current trip to Bannerghatta National Park?"
      ],
      "responses": [
        "Okay, navigating to {destination}. You're estimated to arrive in {time} minutes, covering {distance} kilometers.",
        "I've found the fastest route to {destination}. Traffic appears {traffic_level}, adding about {delay} minutes to your journey.",
        "Reversing your current route. I'll guide you back to {previous_point}.",
        "Your next instruction is to {maneuver} onto {road_name} in {distance} meters. The current speed limit is {speed_limit} km/h.",
        "Here are a few alternative routes to {destination}. The quickest one avoids the current {road_condition} on {road_name}."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "Navigate to RVCE Main Gate from my current location.",
        "Drive me to the RVCE Boys Hostel.",
        "What's the quickest route to Electronic City from RVCE?",
        "Show me the way to the CSE Department from the RVCE Canteen.",
        "How long will it take to reach Kempegowda International Airport from RVCE with current traffic?",
        "Are there any parking spots near the RVCE Auditorium?",
        "Can you guide me to Jayanagar 4th Block?",
        "What's the traffic situation on Mysore Road right now?",
        "Find an alternative route to Koramangala from RVCE to avoid heavy traffic.",
        "How do I get to the RVCE Library?",
        "Start navigation to Lal Bagh, avoiding tolls.",
        "What's the next turn if I'm heading towards Silk Board Junction?",
        "Guide me to reverse out of this parking spot.",
        "How far is the RVCE Placement Cell from here?",
        "I need to go to Vidhana Soudha. Can you give me the fastest route?",
        "Is there a shortcut to Banashankari from RVCE?",
        "Cancel the current navigation.",
        "Show me the estimated time of arrival at Indiranagar.",
        "Drive to the RVCE Sports Complex.",
        "What's the current route information to MG Road?"
      ],
      "responses": [
        "Starting navigation to {destination}. You'll reach in approximately {time} covering {distance}.",
        "The current traffic situation on your route to {destination} is {traffic_condition}. Your estimated time of arrival is {eta}.",
        "Found an alternative route to {destination} which is {time_saved} faster, avoiding {reason, e.g., heavy traffic}. Would you like to switch?",
        "Guiding you to the nearest {location_type} at {destination}. Please proceed {direction} for {distance}.",
        "I can assist with reverse parking. Please shift into reverse gear and follow the visual cues on your display."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "How do I get to RVCE from Majestic Bus Stand?",
        "What's the quickest route to RVCE Main Gate from Koramangala right now?",
        "Navigate to the RVCE Hostel Block B.",
        "Take me to the Mechanical Engineering Department at RVCE.",
        "Find the fastest way to the RVCE Canteen from my current position.",
        "Directions to the RVCE Auditorium, please.",
        "Show me the best route to UB City from RVCE.",
        "How do I reach Cubbon Park from RVCE?",
        "Guide me to the RVCE Library.",
        "Can you navigate me to the nearest ATM from RVCE Main Gate?",
        "What's the current traffic situation on Mysore Road heading towards RVCE?",
        "How much longer until I reach the RVCE Sports Complex?",
        "Are there any alternative routes to Marathahalli from here to avoid tolls?",
        "What's my estimated time of arrival at RVCE Placement Cell?",
        "Is there any road construction near RVCE Ring Road exit?",
        "Give me step-by-step directions to the Electrical Engineering Department from the Main Gate.",
        "What's the distance to RVCE from my current location?",
        "Start automatic parallel parking.",
        "Help me reverse into this tight spot near the RVCE faculty parking.",
        "Is the RVCE back gate open for exit? If so, show me the route."
      ],
      "responses": [
        "Navigating to {destination}. The estimated travel time is {time}.",
        "I've found the quickest route to {destination}, avoiding heavy traffic. Starting guidance now.",
        "No problem! Guiding you to reverse safely. Please follow the visual cues on the screen.",
        "Activating automatic parking. Please ensure your surroundings are clear and be ready to take over if needed.",
        "Your estimated time of arrival at {location} is {time}, covering a distance of {distance} with current traffic conditions."
      ]
    },
    {
      "category": "Navigation (Drive / Reverse / Auto / Route info)",
      "examples": [
        "What's the fastest way to RVCE main gate from Koramangala?",
        "Navigate me to the RVCE Computer Science department.",
        "Show me the route from RVCE main gate to Gopalan Arcade Mall on Mysore Road.",
        "Is there any traffic on Mysore Road near RVCE right now?",
        "How do I get to the RVCE Boys' Hostel from the Library?",
        "Find the quickest route to RVCE from Majestic, avoiding toll roads.",
        "Give me directions to the RVCE Central Canteen.",
        "Can you estimate the arrival time at RVCE if I leave from Electronic City now?",
        "Start navigation to Forum Mall, Koramangala from RVCE.",
        "What's the best route to the RVCE Auditorium?",
        "Reverse the car into that open parking spot near the Mechanical Engineering block.",
        "Show me alternative routes to MG Road from RVCE campus.",
        "Where is the RVCE Electrical Engineering department?",
        "How long will it take to reach Jayanagar 4th Block from RVCE during peak hours?",
        "Guide me to the main administrative building within RVCE campus.",
        "Are there any road closures or diversions on the way to RVCE from Vijaynagar?",
        "Can you automatically park the car parallel to this curb here at RVCE?",
        "What's my current location and heading within the RVCE campus?",
        "Show me the way to the RVCE Sports Complex from the Main Gate.",
        "Update my route to RVCE to avoid heavy traffic on Ring Road."
      ],
      "responses": [
        "Navigating to {destination}. You're estimated to arrive in {time} based on current traffic.",
        "I've found the optimal route to {location}, accounting for current conditions. Starting now.",
        "Engaging automatic parking. Please ensure the area is clear and supervise the maneuver.",
        "Current traffic conditions suggest it will take about {time} to reach {destination}. There are {number} alternative routes available.",
        "Certainly, here are the detailed directions to {location} within the RVCE campus. It's approximately a {time} walk/drive."
      ]
    }
  ]
}